[
  {
    "id": "RA001",
    "title": "Soft Haze Espresso Cup｜Blush Dawn",
    "category": "Tea Cup Sets",
    "image": "/images/artworks/tea-cup-sets/ra001.jpg",
    "description": "This exquisite Soft Haze Soda Glass｜Blush Dawn cup is crafted from high-quality Jingdezhen porcelain. This cup is extremely positive, as it is made only from natural raw materials and handcrafted from scratch. It will be a beautiful and unique ceramic cup for any tea or espresso lover.\n\nThis personalized coffee lover cup is perfect for birthdays, housewarmings, New Year, or any special occasion. This gift will always hold a cherished place.\n\n♥This listing is for ONE Soft Haze Soda Glass｜Blush Dawn cup. This cup has a volume of approximately 2.7 fl oz (80mL) and weighs about 4.9 oz (140g).\nCup Dimensions:\n\nHeight: 2.4 inches (6 cm)\n\nTop Diameter: 2.7 inches (6.8 cm)\n\nBottom Diameter: 1.9 inches (4.8 cm)\n\n♥The cup showcases a beautiful ceramic gradient glaze that perfectly captures the essence of \"Blush Dawn.\" It transitions from a warm, inviting blush pink at the rim, reminiscent of the first light of sunrise, gradually softening into a delicate, ethereal grey-white at the base, evoking a gentle, soft haze. This unique color blend adds a serene and elegant touch to each piece. This glaze is not painted, ensuring the color will never fade away.\n\n♥All items are meticulously made by hand in Jingdezhen, China, celebrating their authentic handmade origin. The subtle variations in the glaze and the organic forms are hallmarks of this craftsmanship, ensuring that no two pieces are exactly the same and each cup is truly unique.\n\n♥Food, Dishwasher, Microwave SAFE.\n\n2.7oz Unique Gifts For Her, Handmade Porcelain Tea Cup, Minimalist Ceramic Espresso Cup, Personalized Gift For Him, Modern Coffee Tea Cup, Housewarming Gift",
    "dimensions": "Height: 6cm | Diameter: 6cm | Bottom: 4cm",
    "price": "$34.99",
    "available": true,
    "featured": true,
    "dateCreated": "2024-03-19"
  },
  {
    "id": "RA002",
    "title": "Lustre Twilight Bronze Espresso Cup｜Twilight Bronze",
    "category": "Tea Cup Sets",
    "image": "/images/artworks/tea-cup-sets/ra002.jpg",
    "description": "This exquisite Lustre Cup｜Twilight Bronze, with its soda glass-inspired shape, is crafted from high-quality Jingdezhen porcelain. This cup is extremely positive, as it is made only from natural raw materials and handcrafted from scratch. It will be a beautiful and unique ceramic cup for any tea or espresso lover.\n\nThis personalized coffee lover cup is perfect for birthdays, housewarmings, New Year, or any special occasion. This gift will always hold a cherished place.\n\n♥This listing is for ONE Lustre Cup｜Twilight Bronze. This cup has a volume of approximately 3.4 fl oz (100mL) and weighs about 4.9 oz (140g).\nCup Dimensions:\n\nHeight: 2.4 inches (6 cm)\n\nDiameter: 2.7 inches (6.8 cm)\n\n♥The cup showcases a stunning \"Twilight Bronze\" glaze, characterized by its rich, metallic bronze tones with hints of shimmering gold and subtle, soft grey or white undertones. This unique lustre finish evokes the magical glow of twilight, adding a sophisticated and captivating touch to each piece. This glaze is not painted, ensuring the color will never fade away.\n\n♥All items are meticulously made by hand in Jingdezhen, China, celebrating their authentic handmade origin. The subtle variations in the glaze and the organic forms are hallmarks of this craftsmanship, ensuring that no two pieces are exactly the same and each cup is truly unique.\n\n♥Food, Dishwasher, Microwave SAFE.\n\n3.4oz Unique Gifts For Her, Handmade Porcelain Tea Cup, Minimalist Ceramic Espresso Cup, Personalized Gift For Him, Modern Coffee Tea Cup, Housewarming Gift",
    "dimensions": "Height: 6cm | Diameter: 6.8cm | Bottom: 4.8cm",
    "price": "$34.99",
    "available": true,
    "featured": false,
    "dateCreated": "2024-03-19"
  },
  {
    "id": "RS001",
    "title": "Mist Sea Cup & Saucer｜Tide Blue",
    "category": "Coffee Mugs",
    "image": "/images/artworks/coffee-mugs/rs001.jpg",
    "description": "This exquisite Mist Sea Cup & Saucer | Tide Blue set is crafted from high-quality Jingdezhen porcelain. This set is extremely positive, as it is made only from natural raw materials and handcrafted from scratch. It will be a beautiful and unique ceramic cup and saucer for any coffee or tea lover.\n\nThis personalized coffee lover set is perfect for birthdays, housewarmings, New Year, or any special occasion. This gift will always hold a cherished place.\n\n♥This listing is for ONE Mist Sea Cup & Saucer | Tide Blue set. The cup has a comfortable rounded body that tapers slightly towards the base, designed to fit perfectly in your hands. It has a volume of approximately 4.4 fl oz (130mL) and weighs about 5.6 oz (160g).\nCup Dimensions:\n\nHeight: 2.4 inches (6 cm)\n\nTop Diameter: 2.5 inches (6.3 cm)\n\nBottom Diameter: 2.5 inches (6.3 cm)\n\nLength (including handle): 3.7 inches (9.5 cm)\n\nThe accompanying saucer complements the cup with its organic, slightly irregular oval shape and weighs about 8.8 oz (250g).\nSaucer Dimensions:\n\nHeight: 1 inch (2.5 cm)\n\nLength: 5.9 inches (15 cm)\n\nWidth: 2.8 inches (7 cm)\n\n♥The set showcases a beautiful ceramic gradient glaze in shades of deep teal and muted blue-green, reminiscent of tranquil ocean depths or a cloudy sky, perfectly reflecting its \"Tide Blue\" name. This glaze is not painted, ensuring the color will never fade away.\n\n♥All items are meticulously made by hand in Jingdezhen, China, celebrating their authentic handmade origin. The subtle variations in the glaze and the organic forms are hallmarks of this craftsmanship, ensuring that no two pieces are exactly the same and each set is truly unique.\n\n♥Food, Dishwasher, Microwave SAFE.\n\n4.4oz Unique Gifts For Her, Handmade Porcelain Cup and Saucer Set, Minimalist Tide Blue Ceramic Set, Personalized Gift For Him, Modern Coffee Tea Set, Housewarming Gift",
    "dimensions": "",
    "price": "$59.99",
    "available": true,
    "featured": false,
    "dateCreated": "2024-03-19"
  },
  {
    "id": "RM002",
    "title": "Raw Clay Mug｜Earth Yellow",
    "category": "Coffee Mugs",
    "image": "/images/artworks/coffee-mugs/rm002.jpg",
    "description": "This exceptional Raw Clay Mug in Earth Yellow celebrates the natural beauty of unfinished ceramic art. Handcrafted from premium Jingdezhen clay, this unique coffee mug showcases the organic texture and warm earth tones that make each piece truly one-of-a-kind.\n\nThe raw clay finish provides a tactile experience that connects you to the ancient art of ceramic making. This handmade mug holds approximately 10 fl oz (300mL) and features a comfortable handle designed for daily use.\n\n♥This listing is for ONE Raw Clay Mug in Earth Yellow. The natural clay finish means each mug has unique variations in color and texture, making your piece truly individual.\n\n♥All items are meticulously made by hand in Jingdezhen, China, celebrating their authentic handmade origin. The natural variations in the clay and organic forms are hallmarks of this craftsmanship.\n\n♥Food Safe, Microwave Safe. Hand washing recommended to preserve the natural clay finish.\n\n10oz Unique Gifts, Handmade Raw Clay Ceramic Mug, Natural Earth Pottery, Personalized Gift, Modern Rustic Coffee Cup, Artisan Ceramic Mug",
    "dimensions": "Height: 9cm | Diameter: 8.5cm | Bottom: 7cm",
    "price": "$59.99",
    "available": true,
    "featured": false,
    "dateCreated": "2024-03-19"
  },
  {
    "id": "RS002",
    "title": "Bamboo Grove Teaware Set｜Forest Green",
    "category": "Coffee Mugs",
    "image": "/images/artworks/coffee-mugs/rs002.jpg",
    "description": "This exquisite Bamboo Joint Tea Set · Celadon Green is crafted from high-quality Jingdezhen porcelain. This set is extremely positive, as it is made only from natural raw materials and handcrafted from scratch. It will be a beautiful and unique ceramic cup and saucer for any coffee or tea lover.\n\nThis personalized tea lover set is perfect for birthdays, housewarmings, New Year, or any special occasion. This gift will always hold a cherished place.\n\n♥This listing is for ONE Bamboo Joint Tea Set · Celadon Green. The cup features a distinctive bamboo joint-inspired texture and a comfortable handle, designed to fit perfectly in your hands. It has a volume of approximately 4.7 fl oz (140mL) and weighs about 5.3 oz (150g).\nCup Dimensions:\n\nHeight: 2.8 inches (7 cm)\n\nDiameter: 2.4 inches (6 cm)\n\nLength (including handle): 3.5 inches (9 cm)\n\nThe accompanying saucer complements the cup with its organic, slightly irregular shape and weighs about 8.8 oz (250g). It features a raised base, adding to its unique aesthetic.\nSaucer Dimensions:\n\nHeight: 1.2 inches (3 cm)\n\nDiameter: 5.1 inches (13 cm)\n\nWidth: 2.2 inches (5.5 cm)\n\n♥The set showcases a beautiful celadon green glaze with subtle variations, reminiscent of natural bamboo and verdant landscapes. This glaze is not painted, ensuring the color will never fade away.\n\n♥All items are meticulously made by hand in Jingdezhen, China, celebrating their authentic handmade origin. The subtle variations in the glaze and the organic forms are hallmarks of this craftsmanship, ensuring that no two pieces are exactly the same and each set is truly unique.\n\n♥Food, Dishwasher, Microwave SAFE.\n\n4.7oz Unique Gifts For Her, Handmade Porcelain Tea Set, Minimalist Celadon Green Ceramic Set, Personalized Gift For Him, Modern Tea Coffee Set, Housewarming Gift",
    "dimensions": "",
    "price": "$59.99",
    "available": true,
    "featured": true,
    "dateCreated": "2024-03-19"
  },
  {
    "id": "RM004",
    "title": "Frostline Mug｜Stone Base Blue",
    "category": "Coffee Mugs",
    "image": "/images/artworks/coffee-mugs/rm004.jpg",
    "description": "",
    "dimensions": "Height: 8.5cm | Diameter: 6.8cm | Bottom: 6.8cm | Length: 10.5cm",
    "price": "$59.99",
    "available": true,
    "featured": false,
    "dateCreated": "2024-03-19"
  },
  {
    "id": "RM005",
    "title": "Sky Mist Mug｜Cerulean",
    "category": "Coffee Mugs",
    "image": "/images/artworks/coffee-mugs/rm005.jpg",
    "description": "Discover pure tranquility with this exceptional mug, meticulously handcrafted from scratch using premium, all-natural Jingdezhen porcelain. This Sky-Blue Gradient Mug is a testament to unparalleled artistry, offering a truly unique and deeply cherished ceramic piece for every discerning coffee and tea enthusiast.\n\nMore than just a mug, this is a heartfelt and personalized gift. It's perfect for celebrating birthdays, warming a new home, ushering in the New Year, or simply showing appreciation. This thoughtful present will forever hold a special, treasured place.\n\n♥ This listing is for ONE exquisite Sky-Blue Gradient Porcelain Mug, generously holding 10 fluid ounces (300ml) – the ideal volume for your favorite brew.\n\n♥ Mug Dimensions:\nHeight: 3.5 inches (9 cm)\nTop Diameter: 3.0 inches (7.5 cm)\nBottom Diameter: 3.0 inches (7.5 cm)\nLength (including handle): 4.3 inches (11 cm)\n\n♥ Crafted for your convenience and peace of mind: Food Safe, Dishwasher Safe, and Microwave Safe.\n\n♥ Our mugs boast a durable, rich ceramic glaze – never painted – ensuring its captivating sky-blue gradient will never fade away, preserving its beauty for years to come.\n\n♥ Each piece is a unique work of art, lovingly made by hand in the historic heart of Jingdezhen, China. Embrace the subtle, charming variations that confirm its genuine handmade authenticity.\n\n10oz Unique Gifts For Her, Artisan Porcelain Mug, Natural Zen Series Tea Cup, Personalized Gift For Him, Modern Ceramic Coffee Cup, Housewarming Gift, Hand-Thown Pottery, Authentic Jingdezhen Craft\n\nNote: this listing has only one cup without saucer.",
    "dimensions": "Height: 7.8cm | Diameter: 9cm | Bottom: 9cm | Length: 12cm",
    "price": "$49.99",
    "available": true,
    "featured": true,
    "dateCreated": "2024-03-19"
  },
  {
    "id": "RM006",
    "title": "Industrial Soda Glass｜Ash Grey",
    "category": "Coffee Mugs",
    "image": "/images/artworks/coffee-mugs/rm006.jpg",
    "description": "This striking Industrial Soda Glass Mug in Ash Grey combines modern minimalist design with traditional Jingdezhen porcelain craftsmanship. The sleek cylindrical form and sophisticated ash grey glaze create a contemporary aesthetic perfect for modern homes and offices.\n\nInspired by industrial design principles, this handcrafted ceramic mug features clean lines and a substantial feel that makes every coffee break feel special. The smooth glaze finish provides a comfortable drinking experience while showcasing the artisan's skill.\n\n♥This listing is for ONE Industrial Soda Glass Mug in Ash Grey. This mug has a volume of approximately 8 fl oz (240mL) and features a sturdy handle designed for comfortable daily use.\n\nMug Dimensions:\nHeight: 9cm (3.5 inches)\nDiameter: 7.5cm (3 inches)\nLength (including handle): 11cm (4.3 inches)\n\n♥The mug showcases a sophisticated ash grey glaze that evokes industrial concrete and modern minimalism. This glaze is fired at high temperature, ensuring durability and color permanence.\n\n♥All items are meticulously made by hand in Jingdezhen, China, celebrating their authentic handmade origin. Each piece is unique with subtle variations that are hallmarks of true craftsmanship.\n\n♥Food, Dishwasher, Microwave SAFE.\n\n8oz Modern Ceramic Mug, Industrial Design Coffee Cup, Minimalist Grey Mug, Handmade Porcelain, Contemporary Ceramic Art, Office Coffee Mug",
    "dimensions": "Height: 9cm | Diameter: 7.5cm | Bottom: 7.5cm | Length: 11cm",
    "price": "$34.99",
    "available": true,
    "featured": false,
    "dateCreated": "2024-03-19"
  },
  {
    "id": "RS003",
    "title": "Impressionist Mug & Saucer｜Rose Ochre",
    "category": "Coffee Mugs",
    "image": "/images/artworks/coffee-mugs/rs003.jpg",
    "description": "This exquisite Impressionist Mug & Saucer · Terra Blush set is crafted from high-quality Jingdezhen porcelain. This set is extremely positive, as it is made only from natural raw materials and handcrafted from scratch. It will be a beautiful and unique ceramic mug and saucer for any coffee or tea lover.\n\nThis personalized coffee lover set is perfect for birthdays, housewarmings, New Year, or any special occasion. This gift will always hold a cherished place.\n\n♥This listing is for ONE Impressionist Mug & Saucer · Terra Blush set. The mug has a comfortable, slightly rustic form and a sturdy handle, designed to fit perfectly in your hands. It has a volume of approximately 3.7 fl oz (110mL) and weighs about 6.3 oz (180g).\nMug Dimensions:\n\nHeight: 2.4 inches (6 cm)\n\nDiameter: 2.5 inches (6.3 cm)\n\nLength (including handle): 3.7 inches (9.5 cm)\n\nThe accompanying saucer complements the mug with its organic shape and weighs about 8.8 oz (250g).\nSaucer Dimensions:\n\nHeight: 1 inch (2.5 cm)\n\nDiameter: 5.9 inches (15 cm)\n\n♥The set showcases a beautiful \"Terra Blush\" glaze, characterized by its impressionistic, painterly swirls of earthy blush tones and soft off-white. This unique glaze creates a captivating, organic pattern on each piece, reminiscent of natural stone or abstract art. This glaze is not painted, ensuring the color will never fade away.\n\n♥All items are meticulously made by hand in Jingdezhen, China, celebrating their authentic handmade origin. The subtle variations in the glaze and the organic forms are hallmarks of this craftsmanship, ensuring that no two pieces are exactly the same and each set is truly unique.\n\n♥Food, Dishwasher, Microwave SAFE.\n\n6.3oz Unique Gifts For Her, Handmade Porcelain Mug and Saucer Set, Impressionist Terra Blush Ceramic Set, Personalized Gift For Him, Modern Coffee Tea Set, Housewarming Gift",
    "dimensions": "Height: 6.5cm | Diameter: 8cm | Bottom: 6cm",
    "price": "$59.99",
    "available": true,
    "featured": true,
    "dateCreated": "2024-03-19"
  },
  {
    "id": "RM008",
    "title": "Monet Style Teacup｜Lake Green",
    "category": "Coffee Mugs",
    "image": "/images/artworks/coffee-mugs/rm008.jpg",
    "description": "This enchanting Monet Style Teacup in Lake Green captures the impressionistic beauty of water lilies on a tranquil pond. Handcrafted from premium Jingdezhen porcelain, this artistic tea cup features flowing, organic glazes that mirror the dreamy quality of Monet's masterpieces.\n\nThe Lake Green glaze creates a serene, aquatic atmosphere with subtle variations that make each cup unique. This handmade ceramic piece brings the peaceful essence of impressionist art to your daily tea ritual, transforming every sip into a moment of artistic contemplation.\n\n♥This listing is for ONE Monet Style Teacup in Lake Green. This cup has a volume of approximately 6 fl oz (180mL) and features an elegant, slightly flared rim for optimal tea appreciation.\n\n♥The cup showcases a beautiful Lake Green glaze with subtle blue-green undertones reminiscent of Monet's water garden paintings. The impressionistic glaze technique creates organic color variations that capture light beautifully.\n\n♥All items are meticulously made by hand in Jingdezhen, China, celebrating their authentic handmade origin. The artistic variations in the glaze are hallmarks of this impressionistic craftsmanship.\n\n♥Food, Dishwasher, Microwave SAFE.\n\n6oz Artistic Tea Cup, Impressionist Style Ceramic, Lake Green Pottery, Handmade Porcelain, Monet Inspired Design, Art Lover Gift",
    "dimensions": "Height: 7cm | Diameter: 8cm | Bottom: 5cm",
    "price": "$49.99",
    "available": true,
    "featured": false,
    "dateCreated": "2024-03-19"
  },
  {
    "id": "RM009",
    "title": "Monet Style Teacup｜Morning Fade",
    "category": "Coffee Mugs",
    "image": "/images/artworks/coffee-mugs/rm009.jpg",
    "description": "This delicate Monet Style Teacup in Morning Fade evokes the gentle transition of dawn breaking over a misty landscape. Handcrafted from finest Jingdezhen porcelain, this artistic tea cup features soft, ethereal glazes that capture the fleeting beauty of early morning light.\n\nThe Morning Fade glaze creates a dreamy gradient from warm peachy tones to soft grey mist, reminiscent of impressionist paintings of sunrise. This handmade ceramic piece transforms your tea time into a meditative experience, connecting you with the serene beauty of nature's daily awakening.\n\n♥This listing is for ONE Monet Style Teacup in Morning Fade. This cup has a volume of approximately 5 fl oz (150mL) and features a delicate, thin rim for an elegant drinking experience.\n\n♥The cup showcases a beautiful Morning Fade glaze with subtle peach and grey tones that blend like watercolors on canvas. The impressionistic technique creates unique color variations that shift with changing light.\n\n♥All items are meticulously made by hand in Jingdezhen, China, celebrating their authentic handmade origin. The artistic variations in the glaze are hallmarks of this impressionistic craftsmanship.\n\n♥Food, Dishwasher, Microwave SAFE.\n\n5oz Artistic Tea Cup, Morning Light Ceramic, Impressionist Pottery, Handmade Porcelain, Fade Glaze Design, Dawn Inspired Teacup",
    "dimensions": "Height: 6.5cm | Diameter: 7.5cm | Bottom: 4.5cm",
    "price": "$34.99",
    "available": true,
    "featured": false,
    "dateCreated": "2024-03-19"
  },
  {
    "id": "RM010",
    "title": "Monet Style Mug｜Blossom Handle",
    "category": "Coffee Mugs",
    "image": "/images/artworks/coffee-mugs/rm010.jpg",
    "description": "This extraordinary Monet Style Mug with Blossom Handle represents the pinnacle of artistic ceramic craftsmanship. Handcrafted from premium Jingdezhen porcelain, this unique coffee mug features an innovative blossom-shaped handle that blooms from the cup like a delicate flower in an impressionist garden.\n\nThe sculptural blossom handle is not just beautiful but also ergonomically designed for comfortable use. Combined with the impressionistic glaze work, this handmade ceramic piece transforms your daily coffee ritual into an artistic experience that celebrates both form and function.\n\n♥This listing is for ONE Monet Style Mug with Blossom Handle. This mug has a volume of approximately 10 fl oz (300mL) and features the signature blossom handle that makes each piece a conversation starter.\n\nMug Dimensions:\nHeight: 9cm (3.5 inches)\nDiameter: 8cm (3.1 inches)\nLength (including blossom handle): 12cm (4.7 inches)\n\n♥The mug showcases impressionistic glazes that complement the organic blossom handle design. Each piece features unique color variations that capture the essence of a blooming garden.\n\n♥All items are meticulously made by hand in Jingdezhen, China, celebrating their authentic handmade origin. The sculptural handle requires exceptional skill to create, making each mug truly special.\n\n♥Food, Dishwasher, Microwave SAFE.\n\n10oz Artistic Coffee Mug, Blossom Handle Design, Sculptural Ceramic Art, Impressionist Style Pottery, Unique Handle Mug, Garden Inspired Design",
    "dimensions": "Height: 9cm | Diameter: 8cm | Length: 12cm",
    "price": "$54.99",
    "available": true,
    "featured": false,
    "dateCreated": "2024-03-19"
  },
  {
    "id": "RM011",
    "title": "Monet Style Mug｜Moss Brown",
    "category": "Coffee Mugs",
    "image": "/images/artworks/coffee-mugs/rm011.jpg",
    "description": "This sophisticated Monet Style Mug in Moss Brown evokes the rich, earthy tones of an ancient forest floor dappled with filtered sunlight. Handcrafted from premium Jingdezhen porcelain, this artistic coffee mug features deep, organic glazes that capture the essence of natural moss-covered landscapes.\n\nThe Moss Brown glaze creates a grounding, earthy presence with subtle green undertones that shift and change as light plays across the surface. This handmade ceramic piece brings the tranquil energy of forest walks to your daily coffee ritual, creating moments of natural connection in urban life.\n\n♥This listing is for ONE Monet Style Mug in Moss Brown. This mug has a volume of approximately 12 fl oz (350mL) and features a substantial, comfortable form perfect for leisurely coffee enjoyment.\n\nMug Dimensions:\nHeight: 10cm (4 inches)\nDiameter: 9cm (3.5 inches)\nLength (including handle): 13cm (5.1 inches)\n\n♥The mug showcases a rich Moss Brown glaze with organic variations reminiscent of forest textures and natural patina. The impressionistic technique creates depth and visual interest that changes throughout the day.\n\n♥All items are meticulously made by hand in Jingdezhen, China, celebrating their authentic handmade origin. The natural variations in the glaze are hallmarks of this earth-inspired craftsmanship.\n\n♥Food, Dishwasher, Microwave SAFE.\n\n12oz Earth Tone Coffee Mug, Forest Inspired Ceramic, Moss Brown Pottery, Natural Glaze Mug, Organic Style Coffee Cup, Nature Lover Gift",
    "dimensions": "Height: 10cm | Diameter: 9cm | Length: 13cm",
    "price": "$56.99",
    "available": true,
    "featured": false,
    "dateCreated": "2024-03-19"
  },
  {
    "id": "RM012",
    "title": "Hand-Painted Teacup｜Sunflower Bloom",
    "category": "Coffee Mugs",
    "image": "/images/artworks/coffee-mugs/rm012.jpg",
    "description": "This radiant Hand-Painted Teacup featuring Sunflower Bloom brings the joy and warmth of a summer garden to your tea ritual. Handcrafted from premium Jingdezhen porcelain, this artistic tea cup showcases exquisite hand-painted sunflower motifs that celebrate the beauty of nature's golden blooms.\n\nEach sunflower is lovingly painted by skilled artisans using traditional ceramic painting techniques, creating vibrant yellow petals and rich brown centers that seem to glow with inner light. This handmade ceramic piece transforms every tea session into a celebration of life's simple pleasures and natural beauty.\n\n♥This listing is for ONE Hand-Painted Teacup with Sunflower Bloom design. This cup has a volume of approximately 8 fl oz (240mL) and features delicate hand-painted details that make each piece truly unique.\n\nTeacup Dimensions:\nHeight: 8cm (3.1 inches)\nDiameter: 8.5cm (3.3 inches)\nBottom: 5.5cm (2.2 inches)\n\n♥The cup showcases vibrant hand-painted sunflowers using traditional ceramic pigments that are fired to ensure lasting beauty. Each bloom is individually painted, making every cup a one-of-a-kind artwork.\n\n♥All items are meticulously made by hand in Jingdezhen, China, celebrating their authentic handmade origin. The hand-painting process requires exceptional skill and patience, making each cup a precious work of art.\n\n♥Food, Dishwasher, Microwave SAFE.\n\n8oz Hand-Painted Tea Cup, Sunflower Design Ceramic, Floral Pottery Art, Garden Inspired Teacup, Artistic Hand-Painted Porcelain, Summer Bloom Cup",
    "dimensions": "Height: 8cm | Diameter: 8.5cm | Bottom: 5.5cm",
    "price": "$56.99",
    "available": true,
    "featured": false,
    "dateCreated": "2024-03-19"
  },
  {
    "id": "RM013",
    "title": "Splashed-Glaze Cup｜Cascade Blue",
    "category": "Coffee Mugs",
    "image": "/images/artworks/coffee-mugs/rm013.jpg",
    "description": "This dynamic Splashed-Glaze Cup in Cascade Blue captures the spontaneous beauty of flowing water and artistic expression. Handcrafted from premium Jingdezhen porcelain, this innovative ceramic cup features the traditional Chinese splashed-glaze technique that creates dramatic, organic patterns reminiscent of cascading waterfalls.\n\nThe Cascade Blue splashed glaze creates an energetic, fluid composition where deep blues flow and splash across the white porcelain surface. This handmade ceramic piece brings the power and movement of natural water formations to your daily coffee or tea ritual, creating a sense of dynamic energy and artistic freedom.\n\n♥This listing is for ONE Splashed-Glaze Cup in Cascade Blue. This cup has a volume of approximately 7 fl oz (210mL) and features the dramatic splashed-glaze pattern that makes each piece completely unique.\n\nCup Dimensions:\nHeight: 7.5cm (3 inches)\nDiameter: 8cm (3.1 inches)\nBottom: 5cm (2 inches)\n\n♥The cup showcases the traditional splashed-glaze technique where blue glazes are artistically applied to create dramatic, flowing patterns. No two pieces are alike, making each cup a unique work of ceramic art.\n\n♥All items are meticulously made by hand in Jingdezhen, China, celebrating their authentic handmade origin. The splashed-glaze technique requires exceptional skill and artistic vision to achieve these dynamic results.\n\n♥Food, Dishwasher, Microwave SAFE.\n\n7oz Splashed Glaze Cup, Cascade Blue Ceramic, Dynamic Pattern Pottery, Traditional Chinese Technique, Waterfall Inspired Design, Artistic Expression Cup",
    "dimensions": "Height: 7.5cm | Diameter: 8cm | Bottom: 5cm",
    "price": "$39.99",
    "available": true,
    "featured": false,
    "dateCreated": "2024-03-19"
  },
  {
    "id": "RT001",
    "title": "Porcelain Mini Vase Magnet｜White Glaze with Handles",
    "category": "Decoration",
    "image": "/images/artworks/decoration/rt001.jpg",
    "description": "This charming Porcelain Mini Vase Magnet with White Glaze and Handles brings the elegance of traditional ceramic art to your modern home in a delightfully functional form. Handcrafted from premium Jingdezhen porcelain, this miniature decorative vase features a pristine white glaze and delicate handles that showcase classic ceramic proportions in perfect miniature scale.\n\nThis unique magnetic mini vase serves as both functional decoration and artistic statement piece. The strong magnet allows it to grace your refrigerator, office magnetic board, or any metal surface while holding small dried flowers, notes, or simply standing as a beautiful ceramic accent.\n\n♥This listing is for ONE Porcelain Mini Vase Magnet with White Glaze and Handles. This miniature vase measures approximately 3 inches in height and features a strong rare-earth magnet securely attached to the back.\n\nMini Vase Dimensions:\nHeight: 7.5cm (3 inches)\nWidth: 4cm (1.6 inches) including handles\nDepth: 2.5cm (1 inch)\n\n♥The mini vase showcases a pristine white glaze with traditional ceramic handles that demonstrate the artisan's skill in creating detailed work at miniature scale. The clean lines and classical proportions make it perfect for any decorating style.\n\n♥All items are meticulously made by hand in Jingdezhen, China, celebrating their authentic handmade origin. Creating functional ceramics at this small scale requires exceptional precision and artistry.\n\n♥Decorative use recommended. Strong magnetic backing.\n\nMiniature Ceramic Art, Magnetic Porcelain Vase, White Glaze Decoration, Functional Ceramic Magnet, Traditional Style Mini Vase, Handcrafted Porcelain Gift",
    "dimensions": "Height: 7.5cm | Width: 4cm | Depth: 2.5cm",
    "price": "$49.99",
    "available": true,
    "featured": false,
    "dateCreated": "2024-03-19"
  }
]